[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if (faces < 2) {
-            this._faces = 6;
-        } else {
-            this._faces = faces;
-        }
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
-        this._last = 0;
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller tests with 6 faces Rolling an invalid number should return 0 and not update the distribution
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/Roller.ts:32:33
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number {
-        if (value < 1 || value > this._faces) {
-            return 0;
-        } else {
-            this._last = value;
-            let x = this._distribution.get(value) + 1;
-            this._distribution.set(value, x);
-            return value;
-        }
-    }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests with 6 faces Rolling an invalid number should return 0 and not update the distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/Roller.ts:35:16
     roll(value: number): number {
         if (value < 1 || value > this._faces) {
             return 0;
-        } else {
-            this._last = value;
-            let x = this._distribution.get(value) + 1;
-            this._distribution.set(value, x);
-            return value;
-        }
+        } else {}
     }
 
killedBy: Roller tests with 6 faces Rolling a valid number multiple times should update the last roll value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] ArithmeticOperator
src/Roller.ts:37:21
             return 0;
         } else {
             this._last = value;
-            let x = this._distribution.get(value) + 1;
+            let x = this._distribution.get(value) - 1;
             this._distribution.set(value, x);
             return value;
killedBy: Roller tests with 3 faces distribution() returns a Map with updated values after rolls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Killed] BlockStatement
src/Roller.ts:54:41
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number> {
-        const distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            if (this._distribution.has(i)) {
-                distribution.set(i, this._distribution.get(i));
-            } else {
-                distribution.set(i, 0);
-            }
-        }
-        return distribution;
-    }
+    distribution(): Map<number, number> {}
 } // end of Roller class
killedBy: Roller tests with 6 faces Rolling an invalid number should return 0 and not update the distribution
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/Roller.ts:56:48
     // value of 0.
     distribution(): Map<number, number> {
         const distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            if (this._distribution.has(i)) {
-                distribution.set(i, this._distribution.get(i));
-            } else {
-                distribution.set(i, 0);
-            }
-        }
+        for (let i = 1; i <= this._faces; i++) {}
         return distribution;
     }
killedBy: Roller tests with 3 faces distribution() returns a Map with the correct keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/Roller.ts:56:25
     // value of 0.
     distribution(): Map<number, number> {
         const distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i > this._faces; i++) {
             if (this._distribution.has(i)) {
                 distribution.set(i, this._distribution.get(i));
killedBy: Roller tests with 3 faces distribution() returns a Map with the correct keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/Roller.ts:57:44
     distribution(): Map<number, number> {
         const distribution = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
-            if (this._distribution.has(i)) {
-                distribution.set(i, this._distribution.get(i));
-            } else {
+            if (this._distribution.has(i)) {} else {
                 distribution.set(i, 0);
             }
killedBy: Roller tests with 3 faces distribution() returns a Map with the correct keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/Roller.ts:57:17
     distribution(): Map<number, number> {
         const distribution = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
-            if (this._distribution.has(i)) {
+            if (false) {
                 distribution.set(i, this._distribution.get(i));
             } else {
killedBy: Roller tests with 3 faces distribution() returns a Map with updated values after rolls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[NoCoverage] BlockStatement
src/Roller.ts:59:20
         for (let i = 1; i <= this._faces; i++) {
             if (this._distribution.has(i)) {
                 distribution.set(i, this._distribution.get(i));
-            } else {
-                distribution.set(i, 0);
-            }
+            } else {}
         }
         return distribution;
